BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega8515.PIC
        <edc:SFRDef edc:_addr="0x57" edc:access="nn-nnnnn" edc:cname="SPMCR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPMEN" edc:desc="Store Program Memory Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PGERS" edc:desc="Page Erase" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PGWRT" edc:desc="Page Write" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BLBSET" edc:desc="Boot Lock Bit Set" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWWSRE" edc:desc="Read-While-Write Section Read Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RWWSB" edc:desc="Read-While-Write Section Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPMIE" edc:desc="SPM Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x58" edc:access="nnn-n---" edc:cname="TIFR" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="ICF1" edc:desc="Input Capture Flag 1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1B" edc:desc="Output Compare Flag 1B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1A" edc:desc="Output Compare Flag 1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOV1" edc:desc="Timer/Counter1 Overflow Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x59" edc:access="nnn-n---" edc:cname="TIMSK" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TICIE1" edc:desc="Timer/Counter1 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1B" edc:desc="Timer/Counter1 Output CompareB Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1A" edc:desc="Timer/Counter1 Output CompareA Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOIE1" edc:desc="Timer/Counter1 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5A" edc:access="nnn-----" edc:cname="GIFR" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="INTF2" edc:desc="External Interrupt Flag 2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTF" edc:desc="External Interrupt Flags" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5B" edc:access="nnn---nn" edc:cname="GICR" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVCE" edc:desc="Interrupt Vector Change Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IVSEL" edc:desc="Interrupt Vector Select" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="INT2" edc:desc="External Interrupt Request 2 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="External Interrupt Request 0 Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1" edc:desc="External Interrupt Request 1 Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x5C" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x5D" edc:access="nnnnnnnnnnnnnnnn" edc:cname="SP" edc:nzwidth="0x10" ltx:memberofperipheral="CPU"/>
        <edc:SFRDef edc:_addr="0x5F" edc:access="nnnnnnnn" edc:cname="SREG" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="Zero Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="Negative Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="V" edc:desc="Two's Complement Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Sign Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="H" edc:desc="Half Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T" edc:desc="Bit Copy Storage" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I" edc:desc="Global Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x60" edc:endaddr="0x260" edc:regionid="IRAM"/>
      <edc:GPRDataSector edc:beginaddr="0x260" edc:endaddr="0x10000" edc:regionid="XRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1E9306"/>
  </edc:SignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x2" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="LOW" edc:factorydefault="0xE1" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SUT_CKSEL" edc:desc="Select Clock Source" edc:nzwidth="0x6">
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_0MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_4MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_64MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_0MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_4MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_64MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_0MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_4MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_64MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_0MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_4MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_64MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_0MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_4MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_64MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_0MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_4MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_64MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_6CK_4MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_4MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_64MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_64MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x3A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x3B"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x0C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x3C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x0D"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x3D"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x0E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x3E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x0F"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BODEN" edc:desc="Brown-out detection enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brownout detector trigger level" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="4V0" edc:desc="Brown-out detection at VCC=4.0 V" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="2V7" edc:desc="Brown-out detection at VCC=2.7 V" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="HIGH" edc:factorydefault="0xD9" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOOTRST" edc:desc="Boot Reset vector Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTSZ" edc:desc="Select Boot Size" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="128W_0F80" edc:desc="Boot Flashsize=128 words Boot address=$0F80" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="256W_0F00" edc:desc="Boot Flash size=256 words Boot address=$0F00" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="512W_0E00" edc:desc="Boot Flash size=512 words Boot address=$0E00" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="1024W_0C00" edc:desc="Boot Flash size=1024 words Boot address=$0C00" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="CKOPT" edc:desc="CKOPT fuse (operation dependent of CKSEL fuses)]" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watch-dog Timer always on" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="S8515C" edc:desc="AT90S4414/8515 compatibility mode" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="--nnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0x3F" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB0" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Application Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB1" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Boot Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
</edc:PIC>